
*** Obtaining the return value only

Let's see how to submit a code block.  Just as in the setup with Emacs
lisp code, simply hit C-c C-c anywhere in the code block to submit it
to R. If you didn't set the confirmation variable to nil as I
described above, you'll have to confirm that you want to evalute the
following R code. 

#+begin_src R
  square <- function(x) {
    x * x
  }
  
  square(1:10)
#+end_src 

#+results:
|   1 |
|   4 |
|   9 |
|  16 |
|  25 |
|  36 |
|  49 |
|  64 |
|  81 |
| 100 |

If you've submitted the code block using C-c C-c, you should have
noticed that your buffer was modified.  Org-babel has inserted a
results section underneath the code block.  These results are from
running the R code block.  Notice how they have been inserted as an
org-table.  This can be very, very useful.  However, what if we wanted
to see the standard R output? Read on! 

You can also try changing the source code block, and re-running it.
For example, try changing the call to the square function to 1:12,
then hit C-c C-c again.  The results have updated to the new value!

*** Obtaining all code block output 

We just saw how the results of evaluating our code are put into an
org-mode table by default. That is potentially very useful, but what
if we just want to see the R output as it would appear printed in the
R console?  Well, just as R function have arguments, org-babel source
blocks have arguments.  One of the arguments controls how the output
is displayed, the :results argument.  It is set to 'value' by default,
but we can change it to 'output' to see the usual R output. Notice the
syntax for setting source code block arguments below.

#+begin_src R :results output
  square <- function(x) {
    x * x
  }

  square(1:10)
#+end_src 

#+results:
:  [1]   1   4   9  16  25  36  49  64  81 100

Now we see the typical R notation for printing a vector. Note in the
following example that setting `:results output` captures *all*
function output, not just the return value.  We capture things printed
to the screen with the `cat` function for example, or the printing of
the variable `x`.

#+begin_src R :results output
  x <- 1:10
  x
  square <- function(x) {
    cat("This is the square function.\n")
    x * x
  }
  
  square(1:10)
#+end_src 

#+results:
:  [1]  1  2  3  4  5  6  7  8  9 10
: This is the square function.
:  [1]   1   4   9  16  25  36  49  64  81 100

Try changing the :results argument to `value` (which is the same as
omitting it completely), and re-run the above code block. You should
see the same org-table output as we saw above.

** R session-based evaluation 

Often in R, we will define functions or objects in one code block
and want to use these objects in subsequent code blocks.  However,
each time we submit a code block using C-c C-c, org-mode is firing up
an R session, submitting the code, obtaining the return values, and
closing down R.  So, by default, our R objects aren't persistent!
That's an important point.  Fortunately, there is an easy way to tell
org-babel to submit our code blocks to a running R process in Emacs,
just like we do with R files in ESS.

You simply use the :session argument to the org-bable source block.   

#+begin_src R :session :results silent 
  square <- function(x) {
    cat("This is the square function.\n")
    x * x
  }
  x <- 1:10 
#+end_src 

So, the above code block defines our function (square) and object (x).
Now we want to apply call our square function with the x
object. Without :session, we could not do this.

#+begin_src R
  square(x)
#+end_src

Running the above code block will result in an error, since a new R
session was started, and our objects were not available. Now try the
same code block, but with the :session argument, as below.

#+begin_src R :session :results output
  square(x)
#+end_src

#+results:
: This is the square function.
:  [1]   1   4   9  16  25  36  49  64  81 100

The results we expect are now inserted!

